<template>
  <div class="login">
    <div class="login-logo">
      <svg
        t="1666587056057"
        class="icon"
        viewBox="0 0 1024 1024"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        p-id="4929"
        width="50"
        height="50"
      >
        <path
          d="M909.4656 695.2448H855.04V432.9472a15.36 15.36 0 0 0-15.36-15.36h-233.6768a95.3344 95.3344 0 0 0-161.7408-96.3584 138.7008 138.7008 0 0 0-130.2528-91.392H249.3952a15.36 15.36 0 0 0-15.36 15.36v64.6144A138.24 138.24 0 0 0 285.696 417.5872H184.32a15.36 15.36 0 0 0-15.36 15.36v262.2976H114.5344a49.4592 49.4592 0 1 0 0 98.9184h794.9312a49.4592 49.4592 0 1 0 0-98.9184zM517.12 317.8496a64.8192 64.8192 0 0 1 64.768 64.768 64.0512 64.0512 0 0 1-10.24 34.9696H462.7968a63.6928 63.6928 0 0 1-10.24-34.9696A64.8704 64.8704 0 0 1 517.12 317.8496z m-252.3648-8.0384v-49.2544h49.2544a107.8784 107.8784 0 0 1 107.52 107.52v27.5456L335.7696 309.8112a15.36 15.36 0 0 0-21.76 21.76l86.0672 86.016h-27.5456a107.8784 107.8784 0 0 1-107.776-107.776zM199.68 448.3072h624.64v34.2528H199.68z m0 195.84h453.632a15.36 15.36 0 0 0 0-30.72H199.68v-100.1472h624.64v38.2976H370.5856a15.36 15.36 0 0 0 0 30.72H824.32v31.1296h-93.4912a15.36 15.36 0 0 0 0 30.72H824.32v51.2H199.68z m709.6832 119.296H114.5344a18.7392 18.7392 0 1 1 0-37.4784h794.9312a18.7392 18.7392 0 0 1 0 37.4784z"
          fill="#58920f"
          p-id="4930"
        ></path>
        <path
          d="M318.6176 551.5776H249.3952a15.36 15.36 0 1 0 0 30.72h69.2224a15.36 15.36 0 1 0 0-30.72z"
          fill="#58920f"
          p-id="4931"
        ></path>
      </svg>
      <h1 style="color: #000000; margin-left: 30px; font-size: 18px">
        抹茶云盘
      </h1>
    </div>
    <div class="login-form">
      <el-form label-position="right" :model="user">
        <el-form-item>
          <el-input
            v-model="user.username"
            placeholder="请输入用户名"
            style="border: 2px solid #dcdfe6"
          ></el-input>
        </el-form-item>
        <el-form-item>
          <el-input
            v-model="user.password"
            type="password"
            placeholder="请输入密码"
            style="border: 2px solid #dcdfe6"
          ></el-input>
        </el-form-item>
        <el-form-item class="login-button">
          <el-button class="loginButton" @click="login">登录</el-button>
        </el-form-item>
        <el-checkbox v-model="checked"></el-checkbox>
        <span
          style="
            font-size: 12px;
            color: #b0b1b3;
            margin-left: 10px;
            cursor: pointer;
          "
          @click="drawer = true"
          >我已阅读并同意服务协议</span
        >
      </el-form>
    </div>

    <el-drawer
      title="服务协议"
      :visible.sync="drawer"
      :direction="direction"
      :before-close="handleClose"
      size="80%"
    >
      <span
        style="
          display: inline-block;
          padding: 0 40px 40px 40px;
          line-height: 30px;
          font-size: 12px;
        "
      >
        <p style="font-size: 18px; text-align: center">提示条款</p>
        《抹茶网盘服务协议》（以下简称“本协议”）是由与所有使用抹茶网盘服务的主体（包括但不限于个人、团队等）（以下简称“您”）与抹茶公司对抹茶网盘服务（以下简称“本服务”）所订立的协议，欢迎您签署本协议并使用抹茶网盘服务！
        <br />【审慎阅读】您在开始使用本服务之前，应当认真阅读本协议。由于您在使用抹茶网盘时将不可避免地使用到抹茶账号服务，故本协议是与《抹茶网盘及服务许可协议》、《抹茶网盘隐私权政策》不可分割的组成部分，同时，抹茶网盘不时发布的关于本服务的各种规范、规则等也是本协议的一部分，您在使用本服务的同时即是对前述文件条款的接受和遵守（以下简称服务条款或条款）。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体下划线标识，您应重点阅读（未成年人应在法定监护人陪同下阅读）。如您对协议有任何疑问，可向抹茶网盘客服咨询。
        <br />【签约动作】使用本产品的任何服务即表示接受本协议的全部条款，包括本协议期限内的您所使用的各项服务和软件的升级和更新。如您不同意本服务条款及(或)
        抹茶网盘随时对其的修改，您应不使用或主动取消抹茶网盘提供的服务。否则，您的任何对本软件中的相关服务的登录、下载、查看、存储等任何使用行为将被视为您对本服务条款全部的完全接受，包括接受抹茶网盘对服务条款随时所做的任何修改。
        <br />一、 抹茶网盘服务内容 <br />1、 服务声明
        <br />抹茶网盘是一个向广大用户提供数据存储、同步、管理和分享等的在线服务。抹茶网盘是信息存储空间平台，其本身不直接上传、提供内容，对您传输内容不做任何修改或编辑。
        <br />2、 服务费用 <br />（1）
        抹茶网盘服务仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由您自行负担。
        <br />（2）抹茶网盘服务分为免费服务和收费服务两种，其中收费服务即抹茶网盘会员服务需您在合法有效地使用抹茶网盘免费服务的基础上另行开通。
        <br />（3）您理解并同意，抹茶网盘有权单方按需要修改或变更所提供的收费服务、收费标准、收费方式、服务费、及服务条款。抹茶网盘在提供服务时，可能现在或日后对部分服务的用户开始收取一定的费用，如果您拒绝支付该等费用，则不能在收费开始后继续使用相关的服务。抹茶网盘将尽最大努力通过网页公告或其他有效方式通知用户有关的修改或变更。
        <br />（4）您理解并同意，抹茶网盘可以根据自身业务发展需要，对您的抹茶网盘空间容量（包括免费和收费容量）进行调整，为充分保护您合法权益，调整容量的通知将提前不少于七日予以公示，在这种情况下您已有的超过调整后容量的存储数据不会被强行删除。
        <br />3、 服务的开通、冻结及终止
        <br />（1）开通：在您登录抹茶网盘并使用提供的任何服务时（包括并不限于进入抹茶网盘服务入口、点击第三方分享的抹茶网盘链接、购买抹茶网盘收费服务），视为您开通抹茶网盘。
        <br />（2）冻结：当您使用的是抹茶网盘提供的免费服务时，为了更合理的利用存储容量资源，如果您超过【1】年以上未登录过抹茶网盘或未使用过抹茶网盘提供的任何服务，我们可通过本协议约定的方式通知您，并有权对抹茶网盘暂时作冻结处理。如采取冻结处理，对于在抹茶网盘上存储的文件，我们可免费为您延长【1】个月的备份存储，在这【1】个月的时间内，您只需要登录抹茶网盘并进入抹茶网盘服务界面申请解冻，便可继续使用抹茶网盘提供的免费服务。
        <br />（3）终止：当您符合本协议规定的相关终止条件，或您的抹茶网盘冻结超过【1】个月而您未能通过指定方式申请解冻的，我们将回收存储容量，由此带来的损失（包括但不限于文件丢失，数据清空等）将由用户自行承担。
        <br />4、个人信息保护。
        <br />抹茶网盘非常重视用户个人信息（即能够独立或与其他信息结合后识别您身份的信息）的保护，在您使用抹茶网盘提供的服务时，您同意抹茶网盘按照在抹茶网盘或软件端公布的隐私权政策收集、存储、使用、披露和保护您的个人信息。抹茶网盘希望通过隐私权政策向您清楚地介绍抹茶网盘对您个人信息的处理方式，因此抹茶网盘建议您完整地阅读抹茶网盘隐私权政策，以帮助您更好地保护您的隐私权。
        <br />根据中华人民共和国法律，在您使用具体的技术服务时，您应通过您的账号提供您的真实身份信息。您通过抹茶网盘提供真实身份信息的，抹茶网盘为您提供了多种方式以协助您提供信息，您应根据您的身份属性选择适合的方式。如您通过支付宝实名认证来提供您的真实信息，您需先行登录支付宝账户，通过将支付宝账户绑定您的抹茶网盘账号完成实名认证，在完成实名认证后，您即通过支付宝向抹茶网盘提交了您的姓名、身份证号码。
        <br />为提高您使用我们及我们关联公司、合作伙伴提供服务的安全性，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或抹茶网盘相关协议、规则的情况，我们可能使用您的账户行为信息、并整合设备信息、有关网络日志以及我们关联公司、合作伙伴分享的信息，来判断您账户及交易风险、进行身份验证、安全事件的检测及防范，并依法采取必要的记录、审计、分析、处置措施。
        <br />二、 使用须知
        <br />1、抹茶网盘的所有权归抹茶，您完成抹茶网盘的开通后，获得抹茶网盘的使用权。您不得滥用抹茶网盘的服务，抹茶网盘服务从属于抹茶账号，仅限您个人作为抹茶账号的实际使用人进行使用，抹茶帐号或抹茶网盘服务不得有偿或无偿提供给任何第三方使用。如果抹茶发现使用者并非抹茶帐号初始注册人，抹茶有权在未经通知的情况下回收抹茶网盘的使用权而无需向您或其他任何第三方承担法律责任，由此带来的包括并不限于资料清空等的损失由您自行承担。
        <br />2、您对抹茶账号及其对应的抹茶网盘使用权承担保管责任，并就其帐号及抹茶网盘项下的一切活动负全部责任。同一帐号仅允许在【2】台设备上使用抹茶网盘，且同时使用的设备不得超过【2】台。所以您应加强个人资料的保护意识，以免对个人生活造成不必要的骚扰。如果您发现他人未经许可使用您的抹茶网盘时立即通知抹茶。
        <br />3、抹茶在此郑重提请您注意，任何经由本服务以上传、张贴、发送即时信息、电子邮件或任何其他方式传送的资讯、资料、文字、软件、音乐、音讯、照片、图形、视讯、信息、您的登记资料或其他资料（以下简称“内容”），无论系公开还是私下传送，均由内容提供者、使用者对其上传、使用行为自行承担责任。抹茶仅向您提供信息存储空间服务，您了解抹茶网盘上的信息系用户自行存储、分享，且可能存在风险和瑕疵。鉴于抹茶网盘具备存在海量信息及信息网络环境下信息与实物相分离的特点，抹茶无法逐一审查用户上传、分享的信息，无法逐一审查用户上传、分享信息的质量、安全以及合法性、真实性、准确性，对此您应谨慎判断。
        <br />4、您需在遵守法律和本协议的前提下，可享有抹茶网盘提供的相关服务。您不得实施包括并不限于如下行为：
        <br />（1）未经抹茶书面同意，您不得擅自使用、出租、出借抹茶网盘，不得以任何方式从任何用户那里获取对抹茶帐号、密码或其他身份验证凭据的访问权，且不得为任何用户自动登录到抹茶帐号、抹茶网盘代理身份验证凭据。
        <br />（2）利用抹茶网盘服务, 发表、传送、传播、储存含有如下信息的内容：
        <br />i. 反对宪法所确定的基本原则的； <br />ii.
        危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； <br />iii.
        损害国家荣誉和利益的； <br />iv.
        煽动民族仇恨、民族歧视，破坏民族团结的； <br />v.
        破坏国家宗教政策，宣扬邪教和封建迷信的； <br />vi.
        散布谣言，扰乱社会秩序，破坏社会稳定的； <br />vii.
        散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； <br />viii.
        侮辱或者诽谤他人，侵害他人合法权益的； <br />ix.
        含有法律、行政法规禁止的其他内容的。 <br />（3）利用抹茶网盘服务,
        发表、传送、传播、储存侵害抹茶或第三方知识产权、商业秘密权等合法权利的内容；
        <br />（4）利用抹茶网盘服务，发表、传送、传播未经抹茶同意的广告信息及垃圾信息；
        <br />（5）通过修改或伪造抹茶网盘服务相关程序运行中的指令、数据、数据包，增加、删减、变动抹茶网盘的服务内容或运行效果；
        <br />（6）干扰、企图干扰或声称可以干扰抹茶网盘或抹茶提供的其他服务的正常运行；避开、尝试避开或声称能够避开任何内容保护机制或者抹茶网盘服务数据度量工具；
        <br />（7）
        其他以任何不合法的方式、为任何不合法的目的、或以任何与本协议不一致的方式使用抹茶网盘或抹茶提供的其他服务；
        <br />5、
        若您使用抹茶网盘服务的行为不符合本协议，抹茶在经由通知、举报等途径发现时有权做出独立判断，且有权在无需事先通知您的情况下立即终止向您提供部分或全部服务。如果抹茶发现您若通过抹茶网盘服务散布和传播反动、色情或其他违反国家法律、法规的信息，抹茶网盘服务的系统记录有可能作为您违反法律法规的证据；因您进行上述内容在抹茶网盘的上载、传播而导致任何第三方提出索赔要求或衍生的任何损害或损失，由您自行承担全部责任。
        <br />6、
        抹茶将根据您使用抹茶网盘的情况，不断改善产品体验，例如提供个性化的服务或提高用户使用服务的安全性。同时，如经由通知、举报等途径发现用户在使用抹茶网盘服务所提供的网络服务时违反任何本协议的规定，抹茶有权要求用户改正或直接采取一切抹茶认为必要的措施（包括但不限于更改或删除用户上载的内容、暂停或终止用户使用网络服务，和/或公示违法或违反本协议约定使用抹茶网盘服务用户账户的权利）以减轻用户不当行为造成的影响。
        <br />四、 风险及免责声明
        <br />1、鉴于网络服务的特殊性，您同意抹茶网盘有权随时变更、中断或终止部分或全部的网络服务。如变更、中断或终止的网络服务属于免费网络服务，抹茶网盘服务无需通知用户，也无需对任何用户或任何第三方承担任何责任。
        <br />2、基于网络环境和您使用网络服务的复杂性，抹茶不承诺抹茶网盘服务适合您的使用要求，不确保您经由抹茶网盘服务取得的任何产品、服务或其他材料符合您的期望。您使用经由抹茶网盘服务下载或取得的任何资料，其风险由您自行承担；因该等使用导致用户电脑系统损坏或资料流失，您应自己负完全责任。该等责任包括由此造成的利润、商业信誉、资料损失或其他有形或无形损失。
        <br />3、您理解并同意，抹茶网盘服务需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，抹茶无需为此承担任何责任，但仍应尽可能事先进行通告。
        <br />4、抹茶网盘服务可在任何时候为任何原因变更本服务或删除其部分功能，且可在任何时候取消或终止对用户的服务。抹茶网盘服务取消或终止服务的决定不需要理由或通知用户。一旦服务取消，您对本服务的权利立即终止。
        一旦本服务取消或终止，您在本服务中储存的任何信息可能无法恢复。 <br />5、
        由于您授权第三方（包括第三方应用）访问/使用其抹茶网盘服务空间的内容所导致的纠纷或损失，应由您自行负责，与抹茶无关。
        <br />五、 其他
        <br />1、本协议项下抹茶网盘服务对于用户所有的通知均可通过网页公告、电子邮件、手机短信或其他有效方式进行；该等通知于发送之日视为已送达收件人。
        <br />2、本协议的订立、执行和解释及争议的解决均应适用中国法律并受中国法院管辖。如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向抹茶所在地人民法院提起诉讼。
      </span>
    </el-drawer>
  </div>
</template>

<script>
import { Login } from "@/api/user";
export default {
  name: "",
  data() {
    return {
      user: {
        username: "",
        password: "",
      },
      // 是否选择条例
      checked: false,
      drawer: false,
      direction: "rtl",
    };
  },
  components: {},
  methods: {
    async login() {
      if (!this.checked) return this.open1(); // 调用element-ui弹窗方法

      console.log(this.user);
      let result = await Login(this.user);
      console.log(result);
      this.$router.push("/home/file");
    },
    handleClose(done) {
      done();
      //   this.$confirm("确认关闭？")
      //     .then((_) => {

      //     })
      //     .catch((_) => {});
    },
    open1() {
      const h = this.$createElement;

      this.$notify({
        title: "温馨提示",
        message: h(
          "i",
          { style: "color: #58920f" },
          "请阅读并勾选服务协议"
        ),
      });
    },
  },
};
</script>

<style scoped>
.login {
  display: flex;
  flex-direction: column;
  height: 100vh;
  display: flex;
  align-items: center;
  /* 垂直居中 */
  justify-content: center;
  /* 水平居中 */

  background: url(~@/assets/2.jpeg);
  background-size: 100% 100%;
  background-attachment: fixed;
}

/* .login::-webkit-scrollbar {
  display: none;
} */

.login-logo {
  display: flex;
  align-items: center;
  /* 垂直居中 */
  justify-content: center;
  /* 水平居中 */
}

.login-form {
  display: flex;
  align-items: center;
  /* 垂直居中 */
  justify-content: center;
  /* 水平居中 */
  width: 100%;
  height: 100%;
  border: 2px solid rgb(247 226 215 / 46%);
  border-radius: 20px;
  background: rgb(247 226 215 / 46%);
  width: 260px;
  height: 260px;
  margin: 35px auto;
  padding: 30px;
  flex-direction: column;
}

.login-button {
  display: flex;
  justify-content: center;
  /* 水平居中 */
}

.loginButton {
  background-color: #7ec1d7;
  color: #ffffff;
  border: 2px solid #ecefff;
  border-radius: 10px;
  width: 220px;
}
::-webkit-scrollbar {
  width: 10px;
}
</style>